address("Αγγελάκη 7", "Αγγελάκη 7").
address("Βασιλέως Γεωργίου 35", "Βασιλέως Γεωργίου 35").
address("Ερμού 22", "Ερμού 22").
address("Κηφισίας 10", "Κηφισίας 10").
address("Πλαστήρα 72", "Πλαστήρα 72").
address("Πολυτεχνείου 19", "Πολυτεχνείου 19").
address("Τσικλητήρα 13", "Τσικλητήρα 13").
address("Τσιμισκή 97", "Τσιμισκή 97").
allows_pets("Αγγελάκη 7", 1).
allows_pets("Βασιλέως Γεωργίου 35", 1).
allows_pets("Ερμού 22", 1).
allows_pets("Κηφισίας 10", 1).
allows_pets("Πλαστήρα 72", 0).
allows_pets("Πολυτεχνείου 19", 0).
allows_pets("Τσικλητήρα 13", 0).
allows_pets("Τσιμισκή 97", 1).
area("Αγγελάκη 7", 45).
area("Βασιλέως Γεωργίου 35", 50).
area("Ερμού 22", 65).
area("Κηφισίας 10", 65).
area("Πλαστήρα 72", 55).
area("Πολυτεχνείου 19", 60).
area("Τσικλητήρα 13", 65).
area("Τσιμισκή 97", 55).
bedrooms("Αγγελάκη 7", 2).
bedrooms("Βασιλέως Γεωργίου 35", 1).
bedrooms("Ερμού 22", 3).
bedrooms("Κηφισίας 10", 2).
bedrooms("Πλαστήρα 72", 2).
bedrooms("Πολυτεχνείου 19", 2).
bedrooms("Τσικλητήρα 13", 3).
bedrooms("Τσιμισκή 97", 3).
floor_number("Αγγελάκη 7", 0).
floor_number("Βασιλέως Γεωργίου 35", 1).
floor_number("Ερμού 22", 1).
floor_number("Κηφισίας 10", 2).
floor_number("Πλαστήρα 72", 1).
floor_number("Πολυτεχνείου 19", 3).
floor_number("Τσικλητήρα 13", 2).
floor_number("Τσιμισκή 97", 0).
has_elevator("Αγγελάκη 7", 0).
has_elevator("Βασιλέως Γεωργίου 35", 0).
has_elevator("Ερμού 22", 0).
has_elevator("Κηφισίας 10", 0).
has_elevator("Πλαστήρα 72", 1).
has_elevator("Πολυτεχνείου 19", 0).
has_elevator("Τσικλητήρα 13", 1).
has_elevator("Τσιμισκή 97", 0).
house("Αγγελάκη 7").
house("Βασιλέως Γεωργίου 35").
house("Ερμού 22").
house("Κηφισίας 10").
house("Πλαστήρα 72").
house("Πολυτεχνείου 19").
house("Τσικλητήρα 13").
house("Τσιμισκή 97").
in_city_center("Αγγελάκη 7", 1).
in_city_center("Βασιλέως Γεωργίου 35", 1).
in_city_center("Ερμού 22", 1).
in_city_center("Κηφισίας 10", 0).
in_city_center("Πλαστήρα 72", 0).
in_city_center("Πολυτεχνείου 19", 1).
in_city_center("Τσικλητήρα 13", 0).
in_city_center("Τσιμισκή 97", 1).
rent_amount("Αγγελάκη 7", 335).
rent_amount("Βασιλέως Γεωργίου 35", 300).
rent_amount("Ερμού 22", 375).
rent_amount("Κηφισίας 10", 350).
rent_amount("Πλαστήρα 72", 330).
rent_amount("Πολυτεχνείου 19", 370).
rent_amount("Τσικλητήρα 13", 320).
rent_amount("Τσιμισκή 97", 350).
yard_area("Αγγελάκη 7", 0).
yard_area("Βασιλέως Γεωργίου 35", 0).
yard_area("Ερμού 22", 12).
yard_area("Κηφισίας 10", 0).
yard_area("Πλαστήρα 72", 15).
yard_area("Πολυτεχνείου 19", 0).
yard_area("Τσικλητήρα 13", 0).
yard_area("Τσιμισκή 97", 15).
